  {
     "type": "Cylinders",
     "number": 6,
    "#radius_description": "Radius of the cylinder. Field is required. Expected type: Float64.",
    "radius": [1.6006095218906675,0.5954719859556001,0.8415783050893212,0.7943961842415931,0.6139404193762205,1.168978446464613],
    "#rotation_description": "Rotation applied to all obstructions in group. Can be set to a matrix or one of :x, :y, or, :z (see [`get_rotation`](@ref)). Field is required. Expected type: StaticArraysCore.SMatrix{3, 2, Float64, 6}.",
    "rotation": [[1.0,0.0,0.0],[0.0,1.0,0.0]],
    "#grid_resolution_description": "Resolution of the grid that the volume is split up into (um). Field is required. Expected type: Float64.",
    "grid_resolution": 1.0,
    "#R1_surface_description": "Additional longitudinal relaxation rate (kHz). Surface property. Field is required. Expected type: Float64.",
    "R1_surface": 0.0,
    "#R1_inside_description": "Additional longitudinal relaxation rate (kHz). Inside property. Field is required. Expected type: Float64.",
    "R1_inside": 0.0,
    "#R2_surface_description": "Additional transverse relaxation rate (kHz). Surface property. Field is required. Expected type: Float64.",
    "R2_surface": 0.0,
    "#R2_inside_description": "Additional transverse relaxation rate (kHz). Inside property. Field is required. Expected type: Float64.",
    "R2_inside": 0.0,
    "#off_resonance_surface_description": "Additional off-resonance field offset (kHz). Surface property. Field is required. Expected type: Float64.",
    "off_resonance_surface": 0.0,
    "#off_resonance_inside_description": "Additional off-resonance field offset (kHz). Inside property. Field is required. Expected type: Float64.",
    "off_resonance_inside": 0.0,
    "#position_description": "Spatial offset of obstruction from origin. Field is required. Expected type: StaticArraysCore.MVector{2, Float64}.",
    "position": [[-0.23631965921838338,-0.33853219923971345],[1.0010387470592685,1.885613593261187],[-0.45188348777746246,2.11703536546249],[2.3726197970155916,0.9838864274409342],[1.9792776732541384,-0.36853439125176646],[-2.437679331963513,-2.0601440601786045]],
    "#g_ratio_description": "Inner/outer radius used for susceptibility calculation Field can be null. Expected type: Float64.",
    "g_ratio": 1.0,
    "#susceptibility_iso_description": "Isotropic component of the susceptibility (in ppm). Field can be null. Expected type: Float64.",
    "susceptibility_iso": -0.1,
    "#susceptibility_aniso_description": "Ansotropic component of the susceptibility (in ppm). Field can be null. Expected type: Float64.",
    "susceptibility_aniso": -0.1,
    "#lorentz_radius_description": "Only compute field explicitly for cylinders with this Lorentz radius. Field can be null. Expected type: Float64.",
    "lorentz_radius": 5.0,
    "#repeats_description": "Length scale on which the obstructions are repeated (um). Field can be null. Expected type: StaticArraysCore.MVector{2, Float64}.",
    "repeats": [5.0,5.0],
    "#use_boundingbox_description": "Use bounding boxes for an initial filtering of possible intersections. Field can be null. Expected type: Bool.",
    "use_boundingbox": true,
    "#dwell_time_description": "Average time a particle stays stuck to the surface (ms). Surface property. Field can be null. Expected type: Float64.",
    "dwell_time": null,
    "#density_description": "Surface density of stuck particles relative to the volume density (um). Surface property. Field can be null. Expected type: Float64.",
    "density": null,
    "#permeability_description": "Probability of particle passing through the obstruction. Surface property. Field can be null. Expected type: Float64.",
    "permeability": null,
    "#relaxivity_description": "Fraction of transverse spin lost each time it hits the obstruction. Surface property. Field can be null. Expected type: Float64.",
    "relaxivity": null
  }
